app/controllers/movies_controller.rb


    if @sort.nil?
      if @checked_ratings.nil?
        @movies = Movie.all
      elsif @checked_ratings == @all_ratings
        @movies = Movie.find(:all, :conditions => {:rating => @checked_ratings})
---
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'PG', "updated_at" = '2013-10-13 01:29:02.502737' WHERE "movies"."id" = 1